Revit 2026 API

# XYZGetLength Method

---

Gets the length of this vector.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double GetLength()
```
```vb
Public Function GetLength As Double
```
```cpp
public:
double GetLength()
```
```fsharp
member GetLength : unit -> float
```

#### Return Value

Double

In 3-D Euclidean space, the length of the vector is the square root of the sum of the three coordinates squared.

#### Reference

XYZ Class

Autodesk.Revit.DB Namespace